Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: ཡིད་ལ་བྱེད་པ་རང་བཞིན་མེད་པར་རིག་པར་བྱའོ། །སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། ཡིད་ལ་བྱེད་པ་སྟོང་པ་ཉིད་དུ་རིག་པར་བྱའོ།
en: One should know that attention is emptiness because the distinct qualities of the buddhas [and so forth] are emptiness.

source: །སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་དབེན་པའི་ཕྱིར། ཡིད་ལ་བྱེད་པ་དབེན་པར་རིག་པར་བྱའོ།
en: One should know that attention is void because the distinct qualities of the buddhas [and so forth] are void.

source: །སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱ་བའི་ཕྱིར། ཡིད་ལ་བྱེད་པ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱ་བར་རིག་པར་བྱའོ།
en: One should know that attention will not attain consummate buddhahood because the distinct qualities of the buddhas [and so forth] will not attain consummate buddhahood. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ། བྱང་ཆུབ་ཀྱི་བར་དུ་མེད་པའི་ཕྱིར། ཡིད་ལ་བྱེད་པ་མེད་པར་རིག་པར་བྱའོ།
en: Venerable Śāradvatīputra, one should know that attention is nonexistent because [the spiritual goals], up to and including enlightenment, are nonexistent.

source: །བྱང་ཆུབ་དངོས་པོ་མེད་པའི་ཕྱིར། ཡིད་ལ་བྱེད་པ་དངོས་པོ་མེད་པར་རིག་པར་བྱའོ།
en: One should know that attention is a nonentity because enlightenment [and so forth] are nonentities.

source: །བྱང་ཆུབ་རང་བཞིན་མེད་པའི་ཕྱིར། ཡིད་ལ་བྱེད་པ་རང་བཞིན་མེད་པར་རིག་པར་བྱའོ།
en: One should know that attention is without inherent existence because enlightenment [and so forth] are without inherent existence.

source: །བྱང་ཆུབ་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། ཡིད་ལ་བྱེད་པ་སྟོང་པ་ཉིད་དུ་རིག་པར་བྱའོ།
en: One should know that attention is emptiness because enlightenment [and so forth] are emptiness.

source: །བྱང་ཆུབ་དབེན་པའི་ཕྱིར། ཡིད་ལ་བྱེད་པ་དབེན་པར་རིག་པར་བྱའོ།
en: One should know that attention is void because enlightenment [and so forth] are void.

source: །བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱ་བའི་ཕྱིར། ཡིད་ལ་བྱེད་པ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱ་བར་རིག་པར་བྱའོ།
en: One should know that attention will not attain consummate buddhahood because enlightenment [and so forth] will not attain consummate buddhahood. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ། རྣམ་གྲངས་དེས་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ། འདི་ལྟ་སྟེ། སྙིང་རྗེ་ཆེན་པོ་ཡིད་ལ་བྱེད་པ་ཉིད་དང་མི་འབྲལ་བར་རིག་པར་བྱའོ།
en: Venerable Śāradvatīputra, those are the formulations explaining how one should know that bodhisattva great beings never part from focusing their attention with great compassion.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ། འདི་སྐད་ཅེས་ལེགས་སོ་ཞེས་བྱ་བ་གནང་སྟེ།
en: Then the Blessed One congratulated the venerable Subhūti with the words, “Well said, Subhūti!

source: རབ་འབྱོར་ལེགས་སོ་ལེགས་སོ།
en: Well said!

source: །དེ་ལྟར་དེ་བཞིན་གཤེགས་པའི་མཐུས། རབ་འབྱོར་ཁྱོད་ཇི་ལྟར་སྟོན་པ་དེ་བཞིན་དུ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྟན་པར་བྱའོ།
en: Through the mighty power of the tathāgatas, the perfection of wisdom should be taught to bodhisattva great beings just as you, Subhūti, have explained it.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཀྱང་ཇི་ལྟར་ཁྱོད་ཀྱིས་བ་སྟན་པ་དེ་བཞིན་དུ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།
en: Bodhisattva great beings should indeed train in the perfection of wisdom, just as you have explained it.”

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ལེའུ་འདི། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་སྨྲས་པའི་ཚེ། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རྣམ་པ་དྲུག་ཏུ་གཡོས་ཏེ། གཡོས་སོ། །རབ་ཏུ་གཡོས་སོ།
en: When the venerable Subhūti had spoken this chapter of the perfection of wisdom, this world system of the great trichiliocosm shook in six ways.

source: །ཀུན་དུ་གཡོས་སོ། །འགུལ་ཏོ།
en: That is to say, it shook, shuddered, and juddered.

source: །རབ་ཏུ་འགུལ་ཏོ། །ཀུན་ཏུ་འགུལ་ཏོ། །ལྡེག་གོ །
en: It rocked, reeled, and tottered.

source: རབ་ཏུ་ལྡེག་གོ །
en: It quivered, careened, and convulsed.

source: ཀུན་དུ་ལྡེག་གོ །ཆེམ་ཆེམ། རབ་ཏུ་ཆེམ་ཆེམ།
en: It trembled, throbbed, and quaked.

source: ཀུན་དུ་ཆེམ་ཆེམ། འུར་འུར་རབ་ཏུ་འུར་འུར།
en: It rumbled, roared, and thundered.

source: ཀུན་དུ་འུར་འུར་རོ། །ཤར་ཕྱོགས་དམའ་བར་གྱུར་ན། ནུབ་ཕྱོགས་མཐོ་བར་གྱུར་ཏོ། །ཤར་ཕྱོགས་མཐོ་བར་གྱུར་ན། ནུབ་ཕྱོགས་དམའ་བར་གྱུར་ཏོ། །བྱང་ཕྱོགས་དམའ་བར་གྱུར་ན།
en: It faltered, lurched, and staggered.

source: ལྷོ་ཕྱོགས་མཐོ་བར་གྱུར་ཏོ། །ལྷོ་ཕྱོགས་དམའ་བར་གྱུར་ན། བྱང་ཕྱོགས་མཐོ་བར་གྱུར་ཏོ། །དབུས་དམའ་བར་གྱུར་ན། མཐའ་མཐོ་བར་གྱུར་ཏོ།
en: As its eastern sides plunged down, its western sides reared up; as its western sides plunged down, its eastern sides reared up; as its southern sides plunged down, its northern sides reared up; as its northern sides plunged down, its southern sides reared up; as its edges plunged down, its center reared up; and as its center plunged down, its edges reared up.

source: །མཐའ་དམའ་བར་གྱུར་ན། དབུས་མཐོ་བར་གྱུར་ཏོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་འཛུམ་པ་མཛད་དོ། །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས།
en: At that time, the Blessed One smiled.

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཅིའི་རྒྱུ་ཅིའི་རྐྱེན་ཀྱིས་འཛུམ་པ་མཛད། དེ་སྐད་ཅེས་གསོལ་བ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ། འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རབ་འབྱོར་ཇི་ལྟར་ང་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདི་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོན་པ་དེ་བཞིན་དུ་ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཚད་མེད་གྲངས་མེད་པ་དག་ན་ཡང་།
en: Then the venerable Subhūti asked the Blessed One, “Blessed Lord, what is the cause and what are the conditions that gave rise to your smile?”

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ཉིད། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་སྟོན་པ་མཛད་དོ། །རབ་འབྱོར་ཇི་ལྟར་ང་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདི་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོན་པ་དེ་བཞིན་དུ་ལྷོ་དང་། ནུབ་དང་། བྱང་དང་། བྱང་ཤར་དང་། ཤར་ལྷོ་དང་། ལྷོ་ནུབ་དང་། ནུབ་བྱང་དང་།
en: The Blessed One replied to the venerable Subhūti, “Subhūti, just as I teach the perfection of wisdom in this world system of Patient Endurance, in immeasurable and countless world systems of the eastern direction, too, the tathāgatas, arhats, completely awakened buddhas teach this very perfection of wisdom to bodhisattva great beings.

source: འོག་དང་། སྟེང་གི་ཕྱོགས་ཀྱི་ཕྱོགས་རེ་རེའི་འཇིག་རྟེན་གྱི་ཁམས་ཚད་མེད་གྲངས་མེད་པ་དག་ན་ཡང་། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ཉིད། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་སྟོན་པ་མཛད་དོ།
en: Subhūti, just as I teach the perfection of wisdom in this world system of Patient Endurance, in immeasurable and countless world systems of the southern, western, northern, northeastern, southeastern, southwestern, and northwestern directions, along with the nadir and the zenith, too, the tathāgatas, arhats, completely awakened buddhas teach this very perfection of wisdom to bodhisattva great beings.” {

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྟན་པ་འདི་བཤད་པའི་ཚེ། ལྷ་དང་མིའི་སྐྱེ་དགུ་ཁྲག་ཁྲིག་ཕྲག་བཅུ་གཉིས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་སྐྱེས་སོ།
en: Dt.269} When this teaching on the perfection of wisdom was being delivered, twelve hundred billion gods and human beings attained acceptance of the nonarising nature of phenomena.

source: །ཕྱོགས་བཅུ་ཀུན་ཏུ་འཇིག་རྟེན་གྱི་ཁམས་སུ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་བསྟན་པའི་ཚེ་ཡང་། སེམས་ཅན་ཚད་མེད་གྲངས་མེད་པ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེས་སོ།
en: Also, when the blessed lord buddhas taught this perfection of wisdom in world systems throughout the ten directions, an immeasurable, countless number of beings set their minds on unsurpassed, complete enlightenment.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས།
en: This completes the thirteenth chapter, “Subhūti,” from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: རབ་འབྱོར་གྱི་ལེའུ་སྟེ་བཅུ་གསུམ་པའོ།། །།
en: Chapter 14 {Ki.

source: དེ་ནས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི། འཇིག་རྟེན་གྱི་ཁམས་འདི་ན། རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ། ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་། ལྷ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་དང་ལྷན་ཅིག་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར།
en: II-III: 1} Then as many gods of the Caturmahā­rāja­kāyika realm as there are in this world system of the great trichiliocosm all congregated there, in that same assembly, along with their gods—many thousands of millions and hundreds of billions in number.

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ཇི་སྙེད་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་། ལྷའི་བུ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་དང་ལྷན་ཅིག་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར།
en: Śakra, mighty lord of the gods [of Trayastriṃśa] and as many gods as there are in the world systems of the great trichiliocosm all congregated there, in that same assembly, along with their gods—many thousands of millions and hundreds of billions in number.

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན། ལྷའི་བུ་རབ་མཚེ་མ་ཇི་སྙེད་ཡོད་པ་དང་། ལྷའི་བུ་རབ་དགའ་ལྡན་ཇི་སྙེད་ཡོད་པ་དང་། ལྷའི་བུ་རབ་འཕྲུལ་དགའ་ཇི་སྙེད་ཡོད་པ་དང་། ལྷའི་བུ་གཞན་འཕྲུལ་དབང་བྱེད་ཇི་སྙེད་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་།
en: All the gods of the Yāma realm, the gods of the Tuṣita realm, the gods of the Nirmāṇarata realm, and the gods of the Para­nirmita­vaśa­vartin realm, as many as there are in the world systems of the great trichiliocosm also congregated there, in that same assembly.

source: ལྷའི་བུ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་དང་ལྷན་ཅིག་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན། ཚངས་པ་ཇི་སྙེད་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་། ལྷའི་བུ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་དང་ལྷན་ཅིག་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན།
en: All the gods presiding over the Brahmā realms, as many as there are in the world systems of the great trichiliocosm, also congregated there, in that same assembly, along with their gods—many thousands of millions and hundreds of billions in number.

source: གནས་གཙང་མའི་བར་གྱི་ལྷའི་བུ་ཇི་སྙེད་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་། ལྷའི་བུ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་དང་ལྷན་ཅིག་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་ཏེ། རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་ཀྱི་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལས་སྐྱེས་པའི་ལུས་ཀྱི་འོད་གང་ཡིན་པ་དང་། སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷ་དང་། མཚེ་མའི་ལྷ་དང་། དགའ་ལྡན་གྱི་ལྷ་དང་། འཕྲུལ་དགའི་ལྷ་དང་། གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷ་དང་། ཚངས་རིས་ཀྱི་ལྷ་དང་། ཀུན་སྣང་དང་བའི་ལྷ་དང་།
en: All the gods presiding over the Pure Abodes, as many as there are in the world systems of the great trichiliocosm, also congregated there, in that same assembly, along with their gods—many thousands of millions and hundreds of billions in number.

source: དགེ་རྒྱས་ཀྱི་ལྷ་དང་། འབྲས་བུ་ཆེ་བའི་ལྷ་དང་། གནས་གཙང་མའི་ལྷ་རྣམས་ཀྱི། ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལས་སྐྱེས་པའི་ལུས་ཀྱི་འོད་གང་ཡིན་པ་དེ་དག་གིས། དེ་བཞིན་གཤེགས་པའི་རང་བཞིན་གྱི་འོད་ཀྱི།
en: Yet the radiance of their bodies, originating through the ripening of the past actions of the gods of the Caturmahā­rāja­kāyika realm, and the radiance of their bodies originating through the ripening of the past actions of the gods of Trayastriṃśa, the gods of Yāma, the gods of Tuṣita, the gods of Nirmāṇarata, the gods of Para­nirmita­vaśa­vartin, the gods of Brahmakāyika [and so forth], the gods of Ābhāsvara [and so forth], the gods of Śubhakṛtsna [and so forth], the gods of Bṛhatphala [and so forth], and the gods of the Pure Abodes did not approach even a hundredth part of the natural radiance of the Tathāgata.

source: བརྒྱའི་ཆར་ཡང་ཉེ་བར་མ་སོང་།
en: They did not approach even a thousandth part of it.

source: སྟོང་གི་ཆར་ཡང་ཉེ་བར་མ་སོང་། བརྒྱ་སྟོང་གི་ཆར་ཡང་ཉེ་བར་མ་སོང་། བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གི་ཆར་ཡང་ཉེ་བར་མ་སོང་།
en: They did not approach a hundred thousandth part, nor a thousand billionth part of it.

source: གྲངས་དང་། ཆ་དང་། བགྲང་བ་དང་། དཔེར་ཡང་མ་བཟོད་དེ། འདི་ལྟ་སྟེ་དཔེར་ན། འཛམ་བུ་ན་དའི་གསེར་གྱི་དྲུང་ན། ལྕགས་ནག་པོའམ། མགལ་དུམ་ལྷམ་མེ་མ་ཡིན།
en: Nor could they approach it in terms of any number, fraction, categorization, or comparison.

source: ལྷན་ནེ་མ་ཡིན། ལྷང་ངེ་མ་ཡིན་པ་དེ་བཞིན་དུ། དེ་བཞིན་གཤེགས་པའི་རང་བཞིན་གྱི་འོད་ཀྱི་དྲུང་ན། ལྷའི་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལས་སྐྱེས་པའི་འོད་དེ་དག་ཐམས་ཅད། ལྷམ་མེ་མ་ཡིན། ལྷན་ནེ་མ་ཡིན། ལྷང་ངེ་མ་ཡིན་གྱི།
en: Just as a piece of dark iron or charred wood neither shines, nor gleams, nor sparkles alongside the gold of the Jambu River, so the radiance of all the gods, originating through the ripening of their past actions, neither shone, nor gleamed, nor sparkled alongside the natural effulgence of the Tathāgata’s body.

source: དེ་བཞིན་གཤེགས་པའི་འོད་འབའ་ཤིག་དེ་དག་གི་ནང་ན་དམ་པར་སྣང་ངོ་།
en: Indeed, the effulgence of the Tathāgata’s body was the best among them.

source: །གཙོ་བོར་སྣང་ངོ་།
en: It was foremost.

source: །གྱ་ནོམ་པར་སྣང་ངོ་།
en: It was abundant.

source: །འཕགས་པར་སྣང་ངོ་།
en: It was superior.

source: །མཆོག་ཏུ་སྣང་ངོ་། །རབ་ཏུ་སྣང་ངོ་།
en: It was supreme.

source: །ཕུལ་དུ་སྣང་ངོ་། །བླ་ན་མེད་པར་སྣང་ངོ་། །གོང་ན་མེད་པར་སྣང་ངོ་། །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ།
en: It was higher. {

source: འདི་སྐད་ཅེས་སྨྲས་སོ། །བཙུན་པ་རབ་འབྱོར་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི། འཇིག་རྟེན་གྱི་ཁམས་ན། རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་དང་།
en: Ki.

source: སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷ་དང་། མཚེ་མའི་ལྷ་དང་།
en: II-III: 2} It was perfect.

source: དགའ་ལྡན་གྱི་ལྷ་དང་།
en: It was unsurpassed, and it was unexcelled.

source: འཕྲུལ་དགའི་ལྷ་དང་། གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷ་དང་། ཚངས་རིས་ཀྱི་ལྷ་དང་། གནས་གཙང་མའི་རིས་ཀྱི་བར་གྱི་ལྷ་གང་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གཏན་ལ་བབ་པར་བསྟན་པ་ཐོས་པར་འདོད་ན། ཆོས་ཉན་པར་འདོད་པའི་ཕྱིར་ལྷགས་ན།
en: Then Śakra, mighty lord of the gods, addressed the venerable Subhūti: “Blessed Subhūti, since we, as many gods as we are in the world systems of the great trichiliocosm, extending from the gods of Caturmahā­rāja­kāyika, the gods of Trayastriṃśa, the gods of Yāma, the gods of Tuṣita, the gods of Nirmāṇarata, the gods of Para­nirmita­vaśa­vartin, the gods of Brahmakāyika [and so forth], up to and including the gods of the Pure Abodes, all wish to hear this teaching on the perfection of wisdom being established, and since we have arrived here because we wish to listen to the Dharma, how then should bodhisattva great beings dwell in the perfection of wisdom?

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ནི་ཇི་ལྟར། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པར་བྱ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་གང་ཡིན།
en: What is the bodhisattva great beings’ perfection of wisdom?

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ནི། ཇི་ལྟར་བསླབ་པར་བྱ། དེ་སྐད་ཅེས་སྨྲས་པ་དང་།
en: How should bodhisattva great beings train in the perfection of wisdom?”

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།། །༄༅༅། །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ། དུམ་བུ་གཉིས་པ། བམ་པོ་ཉི་ཤུ་བདུན་པ། ཀཽ་ཤི་ཀ་དེའི་ཕྱིར་ཤིན་དུ་ལེགས་པར་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་།
en: The venerable Subhūti then replied to Śakra, mighty lord of the gods, “Kauśika, you should therefore listen carefully and keep this in mind!

source: སངས་རྒྱས་ཀྱི་མཐུ་དང་སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ཇི་ལྟར་གནས་པར་བྱ་བ་དང་། ཇི་ལྟར་བསླབ་པར་བྱ་བ་དང་ལྷའི་བུ་གང་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་མ་སྐྱེས་པ་དེ་དག་གིས་ཀྱང་།
en: Through the power of the buddhas, and through the blessings of the buddhas, I will explain to you bodhisattva great beings’ perfection of wisdom, and how bodhisattva great beings should dwell in and train in the perfection of wisdom.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་བྱ་བ་བསྟན་པར་བྱའོ།
en: Those gods among you who have not yet set your minds on unsurpassed, complete enlightenment should set your minds on unsurpassed, complete enlightenment!

source: །གང་ཡང་དག་པར་སྐྱོན་མེད་པར་ཞུགས་པར་གྱུར་པ་དེ་དག་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པའི་མཐུ་མེད་དེ།
en: Those who have already arrived at authentic maturity will not be able to set their minds on unsurpassed complete enlightenment.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་དག་གིས་འཁོར་བའི་རྒྱུན་གྱི་མཚམས་གཅད་པའི་ཕྱིར་ཏེ།
en: If you ask why, it is because they will have been hemmed in by the continuum of cyclic existence.

source: འོན་ཀྱང་གལ་ཏེ་དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན་དེ་དག་ལ་ཡང་རྗེས་སུ་ཡི་རང་ངོ་།
en: However, if they do set their minds on unsurpassed, complete enlightenment, I will rejoice with them.

source: །ཁྱད་པར་དུ་འཕགས་པའི་ཆོས་རྣམས་ལས་ཁྱད་པར་དུ་འཕགས་པའི་ཆོས་རྣམས་འཐོབ་པར་འགྱུར་བས། དེ་དག་གིས་དགེ་བའི་ཕྱོགས་ལ་བདག་ནི་བར་ཆད་མི་བྱེད་དོ།
en: Since they will acquire the most distinguished among the most distinguished of attributes, I will not obstruct those who are on the side of virtuous action. “

source: །ཀཽ་ཤི་ཀ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཞེ་ན།
en: Kauśika, in this regard, what, one might ask, is this perfection of wisdom of bodhisattva great beings?

source: ཀཽ་ཤི་ཀ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་བསྐྱེད་པས། དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་གཟུགས་ནི་མི་རྟག་པར་ཡིད་ལ་བྱའོ།
en: Kauśika, bodhisattva great beings who have set their minds on the enlightenment of all-aspect omniscience should, without apprehending anything, direct their attention to physical forms as being impermanent.

source: །གཟུགས་ནི་སྡུག་བསྔལ་བ་དང་བདག་མེད་པ་དང་ཞི་བ་དང་དབེན་པ་དང་ནད་དང་ཤུ་བ་དང་ཟུག་རྔུ་དང་སྡིག་པ་དང་ན་བ་དང་དགྲ་དང་འཇིག་པའི་ཆོས་ཅན་དང་། མི་བརྟན་པ་དང་འཇིག་པ་དང་འཇིགས་པ་དང་འགོ་བའི་ནད་དང་། སྟོང་པ་ཉིད་དང་བདག་གི་མེད་པ་དང་ཡིད་བརྟན་དུ་མི་རུང་བ་དང་། གནོད་པར་ཡིད་ལ་བྱའོ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་བསྐྱེད་པས།
en: They should direct their attention to physical forms as being suffering, without a self, at peace and void, a disease, a pustule, a sharp pain, negativity and disease, alien, prone to decay, disturbed, brittle, dangerous, contagious, vacuous, unreliable, and calamitous. “

source: དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་ཚོར་བ་དང་། འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་ནི་མི་རྟག་པར་ཡིད་ལ་བྱའོ།
en: Without apprehending anything, those who set their minds on the enlightenment of all-aspect omniscience should direct their attention to feelings, perceptions, formative predispositions, and consciousness as being impermanent.

source: །རྣམ་པར་ཤེས་པ་ནི་སྡུག་བསྔལ་བ་དང་། བདག་མེད་པ་དང་ཞི་བ་དང་དབེན་པ་དང་ནད་དང་ཤུ་བ་དང་ཟུག་རྔུ་དང་སྡིག་པ་དང་ན་བ་དང་དགྲ་དང་འཇིག་པའི་ཆོས་ཅན་དང་། མི་བརྟན་པ་དང་འཇིག་པ་དང་འཇིགས་པ་དང་འགོ་བའི་ནད་དང་། སྟོང་པ་ཉིད་དང་བདག་གི་མེད་པ་དང་ཡིད་བརྟན་དུ་མི་རུང་བ་དང་། གནོད་པར་ཡིད་ལ་བྱའོ།
en: They direct their attention to consciousness [and those other aggregates] as being suffering, without self, at peace and void, a disease, a pustule, a sharp pain, negativity and disease, alien, prone to decay, disturbed, brittle, dangerous, contagious, vacuous, unreliable, and calamitous. “

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་བསྐྱེད་པས། དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་མིག་ནི་མི་རྟག་པར་ཡིད་ལ་བྱའོ།
en: Without apprehending anything, those who set their mind on the enlightenment of all-aspect omniscience should direct their attention to the eyes as being impermanent.

source: །མིག་ནི་སྡུག་བསྔལ་བ་དང་བདག་མེད་པ་དང་། ཞི་བ་དང་དབེན་པ་དང་ནད་དང་ཤུ་བ་དང་ཟུག་རྔུ་དང་སྡིག་པ་དང་ན་བ་དང་དགྲ་དང་འཇིག་པའི་ཆོས་ཅན་དང་། མི་བརྟན་པ་དང་འཇིག་པ་དང་འཇིགས་པ་དང་འགོ་བའི་ནད་དང་སྟོང་པ་ཉིད་དང་བདག་གི་མེད་པ་དང་། ཡིད་བརྟན་དུ་མི་རུང་བ་དང་གནོད་པར་ཡིད་ལ་བྱའོ།
en: They should direct their attention to the eyes as being suffering, without self, at peace and void, a disease, a pustule, a sharp pain, negativity and disease, alien, prone to decay, disturbed, brittle, dangerous, contagious, vacuous, unreliable, and calamitous. “

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་བསྐྱེད་པས་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་རྣ་བ་དང་སྣ་དང་ལྕེ་དང་ལུས་དང་ཡིད་ནི་མི་རྟག་པར་ཡིད་ལ་བྱའོ།
en: Without apprehending anything, those who set their mind on the enlightenment of all-aspect omniscience should direct their attention to the ears, the nose, the tongue, the body, and the mental faculty as being impermanent.

source: །ཡིད་ནི་སྡུག་བསྔལ་བ་དང་བདག་མེད་པ་དང་ཞི་བ་དང་དབེན་པ་དང་ནད་དང་ཤུ་བ་དང་ཟུག་རྔུ་དང་སྡིག་པ་དང་ན་བ་དང་དགྲ་དང་འཇིག་པའི་ཆོས་ཅན་དང་མི་བརྟན་པ་དང་འཇིག་པ་དང་འཇིགས་པ་དང་འགོ་བའི་ནད་དང་སྟོང་པ་ཉིད་དང་བདག་གི་མེད་པ་དང་། ཡིད་བརྟན་དུ་མི་རུང་བ་དང་གནོད་པར་ཡིད་ལ་བྱའོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་བསྐྱེད་པས།
en: They should direct their attention to the mental faculty [and those other sense organs] as being suffering, without self, at peace and void, a disease, a pustule, a sharp pain, negativity and disease, alien, prone to decay, disturbed, brittle, dangerous, contagious, vacuous, unreliable, and calamitous. “

source: དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་གཟུགས་ནི་མི་རྟག་པར་ཡིད་ལ་བྱའོ།
en: Without apprehending anything, those who set their mind on the enlightenment of all-aspect omniscience should direct their attention to sights as being impermanent.

source: །གཟུགས་ནི་སྡུག་བསྔལ་བ་དང་བདག་མེད་པ་དང་ཞི་བ་དང་དབེན་པ་དང་། ནད་དང་ཤུ་བ་དང་ཟུག་རྔུ་དང་སྡིག་པ་དང་ན་བ་དང་དགྲ་དང་འཇིག་པའི་ཆོས་ཅན་དང་མི་བརྟན་པ་དང་འཇིག་པ་དང་འཇིགས་པ་དང་འགོ་བའི་ནད་དང་སྟོང་པ་ཉིད་དང་བདག་གི་མེད་པ་དང་ཡིད་བརྟན་དུ་མི་རུང་བ་དང་། གནོད་པར་ཡིད་ལ་བྱའོ།
en: They should direct their attention to sights as being suffering, without self, at peace and void, a disease, a pustule, a sharp pain, negativity and disease, alien, prone to decay, disturbed, brittle, dangerous, contagious, vacuous, unreliable, and calamitous. “

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་བསྐྱེད་པས་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་སྒྲ་དང་དྲི་དང་རོ་དང་རེག་དང་ཆོས་ནི་མི་རྟག་པར་ཡིད་ལ་བྱའོ།
en: Without apprehending anything, those who set their mind on the enlightenment of all-aspect omniscience should direct their attention to sounds, odors, tastes, tangibles, and mental phenomena as being impermanent.

source: །ཆོས་ནི་སྡུག་བསྔལ་བ་དང་བདག་མེད་པ་དང་ཞི་བ་དང་དབེན་པ་དང་ནད་དང་ཤུ་བ་དང་ཟུག་རྔུ་དང་སྡིག་པ་དང་ན་བ་དང་། དགྲ་དང་འཇིག་པའི་ཆོས་ཅན་དང་མི་བརྟན་པ་དང་འཇིག་པ་དང་འཇིགས་པ་དང་འགོ་བའི་ནད་དང་སྟོང་པ་ཉིད་དང་བདག་གི་མེད་པ་དང་ཡིད་བརྟན་དུ་མི་རུང་བ་དང་། གནོད་པར་ཡིད་ལ་བྱའོ།
en: They should direct their attention to mental phenomena [and those other sense objects] as being suffering, without self, at peace and void, a disease, a pustule, a sharp pain, negativity and disease, alien, prone to decay, disturbed, brittle, dangerous, contagious, vacuous, unreliable, and calamitous. “

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་བསྐྱེད་པས། དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་མིག་གི་རྣམ་པར་ཤེས་པ་ནི་མི་རྟག་པར་ཡིད་ལ་བྱའོ།
en: Without apprehending anything, those who set their mind on the enlightenment of all-aspect omniscience should direct their attention to visual consciousness as being impermanent.

source: །མིག་གི་རྣམ་པར་ཤེས་པ་ནི་སྡུག་བསྔལ་བ་དང་བདག་མེད་པ་དང་ཞི་བ་དང་དབེན་པ་དང་། ནད་དང་ཤུ་བ་དང་ཟུག་རྔུ་དང་སྡིག་པ་དང་ན་བ་དང་དགྲ་དང་འཇིག་པའི་ཆོས་ཅན་དང་མི་བརྟན་པ་དང་འཇིག་པ་དང་འཇིགས་པ་དང་འགོ་བའི་ནད་དང་སྟོང་པ་ཉིད་དང་བདག་གི་མེད་པ་དང་ཡིད་བརྟན་དུ་མི་རུང་བ་དང་གནོད་པར་ཡིད་ལ་བྱའོ།
en: They should direct their attention to visual consciousness as being suffering, without self, at peace and void, a disease, a pustule, a sharp pain, negativity and disease, alien, prone to decay, disturbed, brittle, dangerous, contagious, vacuous, unreliable, and calamitous. “

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་བསྐྱེད་པས། དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་རྣ་བའི་རྣམ་པར་ཤེས་པ་དང་སྣའི་རྣམ་པར་ཤེས་པ་དང་། ལྕེའི་རྣམ་པར་ཤེས་པ་དང་ལུས་ཀྱི་རྣམ་པར་ཤེས་པ་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་ནི་མི་རྟག་པར་ཡིད་ལ་བྱའོ།
en: Without apprehending anything, those who set their mind on the enlightenment of all-aspect omniscience should direct their attention to auditory consciousness, olfactory consciousness, gustatory consciousness, tactile consciousness, and mental consciousness as being impermanent.
